{
  "Sheet1": [
    {
      "File_Name": "EAL_001.jpg",
      "Title": "A Spanish article having Jerónimo Lim Kim (Im Um Yo)'s photographs on it, n.d.",
      "Notes": "Jerónimo Lim Kim's Korean name is Im Um Yo. The article is written in Spanish.",
      "Names": "Jerónimo Lim Kim (Im Um Yo)",
      "Subject": "Object--Document, People--Jerónimo Lim Kim (Im Um Yo), People--Others",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_002.jpg",
      "Title": "A Korean article written by Jerónimo Lim Kim (Im Um Yo) about reunification of North and South Korea, n.d.",
      "Notes": "Jerónimo Lim Kim's Korean name is Im Um Yo. The article is written in Korean.",
      "Names": "Jerónimo Lim Kim (Im Um Yo)",
      "Subject": "Object--Document, People--Jerónimo Lim Kim (Im Um Yo)",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_003.jpg",
      "Title": "Antonio Kim Jam at 4th grade, n.d.",
      "Notes": "Antonio Kim Jam is the president of Korean descendants in Havana City.",
      "Names": "Antonio Kim Jam",
      "Subject": "People--Antonio Kim Jam",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_004.jpg",
      "Title": "Upper left to right, Marta Kin González, an unidentified boy, and an unidentified woman; lower left to right seated on the ground, Celin Chan Kin, and Belen Kin González, n.d.",
      "Notes": "Marta Kin González is Belén Kin González's sister.",
      "Names": "Belén Kin González, Celin Chan Kin, Marta Kin González ",
      "Subject": "People--Belén Kin González, People--Celin Chan Kin, People--Marta Kin González, People--Others",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_005.jpg",
      "Title": "Antonio Kim Jam (center in white shirt) at the event to commemorate Korean Independence day, attended by unidentified people, n.d.",
      "Notes": "Korean Independence Day is August 15th.",
      "Names": "Antonio Kim Jam",
      "Subject": "Event--Others, People--Antonio Kim Jam, People--Others",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_006.jpg",
      "Title": "Juana Kin Gonzále, n.d.",
      "Notes": "N/A",
      "Names": "Juana Kin Gonzále",
      "Subject": "People--Juana Kin Gonzále",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_007.jpg",
      "Title": "Left to right, Ofelia Socarraz Martínez, and Raúl Kin González, n.d.\r\n",
      "Notes": "Ofelia Socarraz Martínez and Raúl Kin González’s wedding.",
      "Names": "Ofelia Socarraz Martínez, Raúl Kin González",
      "Subject": "Event--Wedding, People--Ofelia Socarraz Martínez, People--Raúl Kin González",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_008.jpg",
      "Title": "Left to right, Ofelia Socarraz Martínez and Raúl Kin González, n.d.\r\n",
      "Notes": "N/A",
      "Names": "Ofelia Socarraz Martínez, Raúl Kin González",
      "Subject": "People--Ofelia Socarraz Martínez, People--Raúl Kin González",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_009.jpg",
      "Title": "Left to right, María Kim (Weon Jeon Kim), and Sun Pil Ahn, n.d.",
      "Notes": "María Kim (Weon Jeon Kim) is Antonio Fong Ahn’s grandmother, and Sun Pil Ahn is Antonio Fong Ahn’s grandfather. María Kim's Korean name is Weon Jeon Kim.",
      "Names": "María Kim (Weon Jeon Kim), Sun Pil Ahn",
      "Subject": "People--María Kim (Weon Jeon Kim), People--Sun Pil Ahn",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_010.jpg",
      "Title": "At the wedding of Antonio Fong Ahn (seated at the table, left) and Teresa Arce (seated at the table, right); three women behind the couple left to right, Esteban Ahn, María Kim (Weon Jeon Kim), Milagros Ahn, n.d.",
      "Notes": "Esteban Ahn is Antonio Fong’s cousin. María Kim (Weon Jeon Kim) is Antonio Fong Ahn’s grandmother.  Milagros Ahn is Esteban Ahn’s daughter. ",
      "Names": "Antonio Fong Ahn, Esteban Ahn, María Kim (Weon Jeon Kim), Milagros Ahn, Teresa Arce",
      "Subject": "Event--Wedding, People--Antonio Fong Ahn, People--Esteban Ahn, People--María Kim (Weon Jeon Kim), People--Milagros Ahn, People--Teresa Arce, People--Others",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_011.jpg",
      "Title": "Left to right, Antonio Fong Ahn, María Kim (Weon Jeon Kim), and Teresa Arce, n.d.",
      "Notes": "María Kim (Weon Jeon Kim) is Antonio Fong Ahn’s grandmother. María Kim's Korean name is Weon Jeon Kim. ",
      "Names": "Antonio Fong Ahn, María Kim (Weon Jeon Kim), Teresa Arce",
      "Subject": "Event--Wedding, People--Antonio Fong Ahn, People--María Kim (Weon Jeon Kim), People--Teresa Arce",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_012.jpg",
      "Title": "María Kim (Weon Jeon Kim), n.d.",
      "Notes": "María Kim (Weon Jeon Kim) is Antonio Fong Ahn’s grandmother. María Kim's Korean name is Weon Jeon Kim. ",
      "Names": "María Kim (Weon Jeon Kim)",
      "Subject": "People--María Kim (Weon Jeon Kim)",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_013.jpg",
      "Title": "María Dolores Ahn (center) with her Korean friends in front of Capitolio, Cuba, n.d.",
      "Notes": "María Dolores Ahn is Antonio Fong Ahn’s mother. The photograph was taken in front of Capitolio, Cuba.",
      "Names": "María Dolores Ahn",
      "Subject": "People--María Dolores Ahn, People--Others, Place--Cuba",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_014.jpg",
      "Title": "Susana Ahn, n.d.",
      "Notes": "Susana Ahn is Antonio Fong’s aunt.",
      "Names": "Susana Ahn",
      "Subject": "People--Susana Ahn",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_015.jpg",
      "Title": "María Dolores Ahn, n.d.",
      "Notes": "María Dolores Ahn is Antonio Fong Ahn’s mother. ",
      "Names": "María Dolores Ahn",
      "Subject": "People--María Dolores Ahn",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_016.jpg",
      "Title": "Antonio Kim Jam (right) with unidentified people at the Monument in Manatí, Cuba, n.d.",
      "Notes": "Antonio Kim Jam is the president of Korean descendants in Havana City. The Monument is located in Manatí (province: Las Tunas) where by Koreans emigrants from México got entrance to Cuba.",
      "Names": "Antonio Kim Jam",
      "Subject": "Object--Monument, People-Antonio Kim Jam, People--Others, Place--Cuba",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_017.jpg",
      "Title": "Left to right, Celin Chan Kin, Antonia Kin González, and Isabel Kin González with an unidentified man, n.d.",
      "Notes": "N/A",
      "Names": "Antonia Kin González, Celin Chan Kin, Isabel Kin González",
      "Subject": "People--Antonia Kin González, People--Celin Chan Kin, People--Isabel Kin González, People--Others",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_018.jpg",
      "Title": "Antonio Fong Ahn's family, left to right, María Dolores Ahn, María Kim (Weon Jeon Kim), Olga Fong Ahn, Antonio Fong Ahn, and Antonio Fong, n.d.",
      "Notes": "María Dolores Ahn is Antonio Fong Ahn’s mother. María Kim (Weon Jeon Kim) is Antonio Fong Ahn’s grandmother. María Kim's Korean name is Weon Jeon Kim. Olga Fong Ahn is Antonio Fong Ahn’s sister. Antonio Fong is Antonio Fong Ahn’s father.",
      "Names": "Antonio Fong, Antonio Fong Ahn, María Dolores Ahn, María Kim (Weon Jeon Kim), Olga Fong Ahn",
      "Subject": "People--Antonio Fong, People--Antonio Fong Ahn, People--María Dolores Ahn, People--María Kim (Weon Jeon Kim), People--Olga Fong Ahn",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_019.jpg",
      "Title": "Antonio Fong Ahn's family, upper left to right, María Kim (Weon Jeon Kim) and María Dolores Ahn, lower left to right, Olga Fong Ahn and Antonio Fong Ahn, n.d.",
      "Notes": "María Kim (Weon Jeon Kim) is Antonio Fong Ahn’s grandmother. María Kim's Korean name is Weon Jeon Kim. María Dolores Ahn is Antonio Fong Ahn’s mother. Olga Fong Ahn is Antonio Fong Ahn’s sister. ",
      "Names": "Antonio Fong Ahn, María Dolores Ahn, Olga Fong Ahn, María Kim (Weon Jeon Kim)",
      "Subject": "People--Antonio Fong Ahn, People--María Dolores Ahn, People--Olga Fong Ahn, People--María Kim (Weon Jeon Kim)",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_020.jpg",
      "Title": "Left to right, Antonio Fong and María Dolores Ahn, n.d.",
      "Notes": "Antonio Fong is Antonio Fong Ahn’s father. María Dolores Ahn is Antonio Fong Ahn’s mother. ",
      "Names": "Antonio Fong, María Dolores Ahn",
      "Subject": "People--Antonio Fong, People--María Dolores Ahn",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_021.jpg",
      "Title": "María Dolores Ahn, n.d.",
      "Notes": "María Dolores Ahn is Antonio Fong Ahn’s mother. ",
      "Names": "María Dolores Ahn",
      "Subject": "People--María Dolores Ahn",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_022.jpg",
      "Title": "Lorenzo Ahn, n.d.",
      "Notes": "Lorenzo Ahn is Antonio Fong Ahn’s uncle who lives in Miami, USA.",
      "Names": "Lorenzo Ahn",
      "Subject": "People--Lorenzo Ahn",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_023.jpg",
      "Title": "A stone table of Antonio Fong (12/08/1904-01/02/1997), n.d.",
      "Notes": "Antonio Fong (12/08/1904-01/02/1997) is Antonio Fong Ahn’s father. The stone table is located in New York, USA.",
      "Names": "Antonio Fong",
      "Subject": "Object--Others, People--Antonio Fong, Place--USA",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_024.jpg",
      "Title": "A stone table of María Dolores Ahn (02/06/1914-12/21/1977), n.d.",
      "Notes": "María Dolores Ahn (02/06/1914-12/21/1977) is Antonio Fong Ahn’s mother. The stone table is located in New York, USA. Her name on the stone table is Maria Dolores Fong.",
      "Names": "María Dolores Ahn",
      "Subject": "Object--Others, People--María Dolores Ahn, Place--USA",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_025.jpg",
      "Title": "Left to right, Josefina Jam Hi, Cira Lara Kim, and Victor Kim Kim, n.d.",
      "Notes": "Josefina Jam Hi is Antonio Kim Jam´s mother. Cira Lara Kim is Antonio Kim Jam´s niece. Victor Kim Kim is Antonio Kim Jam´s father.",
      "Names": "Josefina Jam Hi, Cira Lara Kim, Victor Kim Kim",
      "Subject": "People--Josefina Jam Hi, People--Cira Lara Kim, People--Victor Kim Kim",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_026_1.jpg",
      "Title": "An old Korean Bible, possibly the first Korean Bible that was brought to Cuba, n.d.",
      "Notes": "The bible still exists.  ",
      "Names": "N/A",
      "Subject": "Object--Document",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_026_2.jpg",
      "Title": "An old Korean Bible, possibly the first Korean Bible that was brought to Cuba, n.d.",
      "Notes": "The bible still exists.  ",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_027.jpg",
      "Title": "Left to right, Fidela Kim Jam, Antonio Kim Jam, and Josefina Jam Hi, n.d.",
      "Notes": "Antonio Kim Jam is the president of Korean descendants in Havana City. The photograph was taken when Antonio Kim Jam was 2 years old. Josefina Jam Hi is Antonio Kim Jam´s mother. Fidela Kim Jam is Antonio Kim Jam's older sister.",
      "Names": "Antonio Kim Jam, Fidela Kim Jam, Josefina Jam Hi",
      "Subject": "People--Antonio Kim Jam, People--Fidela Kim Jam, People--Josefina Jam Hi",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_028.jpg",
      "Title": "Upper right to left, the first Korean professor in Cuba, Cristina Chang, and Antonio Kim Jam; the upper furthest left, Irma Lim Kim in pink shirt with unidentified people, n.d.",
      "Notes": "Antonio Kim Jam is the president of Korean descendants in Havana City. Cristina Chang is Jerónimo Lim Kim (Im Um Yo)'s wife. Irma Lim Kim is a daughter of Ernesto Lim (Cheon-Taek Lim).",
      "Names": "Antonio Kim Jam, Cristina Chang, Irma Lim Kim",
      "Subject": "People--Antonio Kim Jam, People--Cristina Chang, People--Irma Lim Kim, People--Others",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_029.jpg",
      "Title": "Belén Kin González, 1973",
      "Notes": "N/A",
      "Names": "Belén Kin González",
      "Subject": "People--Belén Kin González",
      "Date": "1973",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_030.jpg",
      "Title": "At the meeing of Korean descendants, the second from the upper right, Cristina Chang; in the middle, Irma Lim Kim in a brown sleeveless shirt, 2012",
      "Notes": "Cristina Chang is Jerónimo Lim Kim (Im Um Yo)'s wife. Irma Lim Kim is a daughter of Ernesto Lim (Cheon-Taek Lim).",
      "Names": "Cristina Chang, Irma Lim Kim",
      "Subject": "People--Cristina Chang, People--Irma Lim Kim, People--Others",
      "Date": "February 1st, 2012",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_031.jpg",
      "Title": "Left to right, Alonso Kim, and Belén Kin González, not after 1959",
      "Notes": "Alonso Kim is Belén Kin González's father. He was a pastor and came from Mexico. The photo was taken before 1959. The surname is a little different because there was a mistake by someone when she was inscribed.",
      "Names": "Alonso Kim, Belén Kin González",
      "Subject": "People--Alonso Kim, People--Belén Kin González",
      "Date": "not after 1959",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_032.jpg",
      "Title": "Right to left, Adelaida Kim Alemán (in a yellow skirt), and Antonio Kim Jam (center), n.d.",
      "Notes": "Adelaida Kim Alemán is the president of Korean descendants in Cárdenas (province: Matanzas). Antonio Kim Jam is the president of Korean descendants in Havana City.  ",
      "Names": "Adelaida Kim Alemán, Antonio Kim Jam",
      "Subject": "People--Adelaida Kim Alemán, People--Antonio Kim Jam, People--Others",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_033.jpg",
      "Title": "Belén Kin González and Ramón Lo’s wedding, 1959 or 1960",
      "Notes": "Ramón Lo is Chinese descendant and the President of Chinese Community in Camagüey.",
      "Names": "Belén Kin González, Ramón Lo",
      "Subject": "Event--Wedding, People--Belén Kin González, People--Ramón Lo, People--Others",
      "Date": "1959 or 1960",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_034.jpg",
      "Title": "Antonio Kim Jam (center) in Russia, n.d.",
      "Notes": "Antonio Kim Jam is the president of Korean descendants in Havana City. Antonio Kim Jam studied in Russia.",
      "Names": "Antonio Kim Jam",
      "Subject": "People--Antonio Kim Jam, People--Others",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_035.jpg",
      "Title": "At the wedding with unidentified people, Marta Kin González in white dress (center) holding a man's hand, and Belén Kin González (right) in black dress, 1950 or 1960",
      "Notes": "Marta Kin González is Belén Kin González's sister. They got married the same day in 1959 or 1960. Belén Kin already passed away, but Marta Kin is still alive. ",
      "Names": "Belén Kin González, Marta Kin González",
      "Subject": "Event--Wedding, People--Belén Kin González, People--Marta Kin González, People--Others",
      "Date": "1959 or 1960",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_036.jpg",
      "Title": "Félix Bermúdez Kim (right), n.d.",
      "Notes": "Félix Bermúdez Kim is the president of Korean descendants in Holguín.",
      "Names": "Félix Bermúdez Kim",
      "Subject": "People--Félix Bermúdez Kim, People--Others",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_037.jpg",
      "Title": "Juana Kin González, in 1940's",
      "Notes": "Juana Kin González is Belén and Marta’s sister.",
      "Names": "Juana Kin Gonzále",
      "Subject": "People--Juana Kin González",
      "Date": "in 1940's",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_038_1.jpg",
      "Title": "A large group of unidentified people attending a baby's birthday party, 1951",
      "Notes": "Notes on the back of the photograph. Left corner: Alfredo Garcia, Photographer, specializing in children, address. Center in black ink: Mexico, Esperanza (maybe, could be the name of a person or place). Upper right in brown ink: to Simona and families Memory/souvenir of a first year (or could be referring to a first birthday party?) April 8, 1951, Gloria Ac Kim?",
      "Names": "N/A",
      "Subject": "Event--Birthday, People--Others",
      "Date": "April 8th, 1951",
      "Photographer": "Alfredo Garcia"
    },
    {
      "File_Name": "EAL_038_2"
    },
    {
      "File_Name": "EAL_039.jpg",
      "Title": "Left to right, Juan, Carmelina (Center), and Rosendo, 1945",
      "Notes": "Carmelina, Rosendo, and Juan were siblings and all born in Cuba.",
      "Names": "Carmelina Kim Jan, Rosendo Kim Jan, Juan Kim Jan",
      "Subject": "People--Carmelina Kim Jan, People--Rosendo Kim Jan, People--Juan Kim Jan",
      "Date": "March 20th, 1945",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_040.jpg",
      "Title": "At the event for an opening ceremony of the Club Martiano, fourth from left, Antonio Kim Jam; Martha Lim Kim (center) in a black shirt, between the two women who are wearing Korean traditional dresses; first from right, Cristina Chang with her hands on the shoulder of an unidentified woman, n.d.",
      "Notes": "At the opening ceremony of the Club Martiano for the friendship between Cuba and South Korea. Antonio Kim Jam is the president of Korean descendants in Havana City. Cristina Chang is Jerónimo Lim Kim (Im Um Yo)'s wife. Martha Lim Kim is a daughter of Ernesto Lim (Cheon-Taek Lim).",
      "Names": "Antonio Kim Jam, Cristina Chang, Martha Lim Kim",
      "Subject": "Event--Others, People--Antonio Kim Jam, People--Cristina Chang, People--Martha Lim Kim, People--Others",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_041.jpg",
      "Title": "Standing behind the cake, Cristina Chang (left) and Im Um Yo (Jerónimo Lim Kim, right) at their wedding; Ediberto Lee, standing on the upper left of the photograph in a white shirt, and a large group of unidentified people around the couple, 1952\r\n",
      "Notes": "The photograph was taken at Cristina Chang and Jerónimo Lim Kim (Im Um Yo)'s wedding. Jerónimo Lim Kim's Korean name is Im Um Yo. Ediberto Lee was one of the first Korean descendant pilot and participated in Angola’s civil war in 1975.",
      "Names": "Cristina Chang, Ediberto Lee, Jerónimo Lim Kim (Im Um Yo)",
      "Subject": "Event--Wedding, People--Cristina Chang, People--Ediberto Lee, People--Jerónimo Lim Kim (Im Um Yo), People--Others",
      "Date": "December 6th, 1952",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_042.jpg",
      "Title": "Cristina Chang, in front of Capitolio, 1967",
      "Notes": "The photograph was taken in front of Capitolio when Cristina Chang was 39 years old. Cristina Chang is Jerónimo Lim Kim (Im Um Yo)'s wife. ",
      "Names": "Cristina Chang",
      "Subject": "People--Cristina Chang, Place--Cuba",
      "Date": "March, 1967",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_043.jpg",
      "Title": "Some Korean descendants who live in Manaquí among the unidentified people, n.d.",
      "Notes": "N/A",
      "Names": "N/A",
      "Subject": "People--Others",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_044.jpg",
      "Title": "Jerónimo Lim Kim (Im Um Yo) (left) with an unidentified man, n.d.",
      "Notes": "N/A",
      "Names": "Jerónimo Lim Kim",
      "Subject": "People--Jerónimo Lim Kim, People--Others",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_045.jpg",
      "Title": "Jerónimo Lim Kim (Im Um Yo) in front of a stone monument in Bulguksa, Korea, n.d.",
      "Notes": "N/A",
      "Names": "Jerónimo Lim Kim",
      "Subject": "People--Jerónimo Lim Kim, Place--Korea",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_046.jpg",
      "Title": "Jerónimo Lim Kim (Im Um Yo) (right) in bright colored suit with red tie, n.d.",
      "Notes": "N/A",
      "Names": "Jerónimo Lim Kim",
      "Subject": "People--Jerónimo Lim Kim, People--Others",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_047.jpg",
      "Title": "An unidentified family in front of a house, n.d.",
      "Notes": "N/A",
      "Names": "N/A",
      "Subject": "People--Others",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_048_1.jpg",
      "Title": "Domingo Lee González's ID, 1938.",
      "Notes": "The name which is written in the official document is Gomingo, instead of Domingo. \r\n* Left page:\r\nIDENTIFICATION\r\nName: Lee Gomingo\r\nDomicile: Bolo / Number:\r\nAge: 19 \r\nState: Single / Date of inscription: January 6th, 1929 \r\nSign\r\nNote: The rights of the associated people can only be justified with the presentation of the identity card at the current receipt of quota. \r\n\r\n* Right page:\r\nCERTIFICATION\r\nInscription number:\r\nWe certify that Mr. Gomingo Lee González appears inscribed at the Registration Book of this collectivity, with date of: January 16th , 1929.\r\nAnd, in order that he can be able to accredit it wherever he needs, we expedite this document in Matanzas, on July 1st, 1938.\r\nMartín Delgado, President\r\nRafael Diaz, Secretary ",
      "Names": "Domingo Lee González",
      "Subject": "Object--Document, People--Domingo Lee González",
      "Date": "July 1st, 1938",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_048_2"
    },
    {
      "File_Name": "EAL_049.jpg",
      "Title": "Jerónimo Lim Kim (Im Um Yo), holding a left poster in a protest against Batista’s government, 1959 ",
      "Notes": "Jerónimo Lim Kim's Korean name is Im Um Yo.",
      "Names": "Jerónimo Lim Kim (Im Um Yo)",
      "Subject": "People--Jerónimo Lim Kim (Im Um Yo), People--Others",
      "Date": "January 21th, 1959",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_050.jpg",
      "Title": "Left to right, Jerónimo Lim Kim (Im Um Yo) and Pastor Daniel at Bolo monument, 2005",
      "Notes": "Jerónimo Lim Kim's Korean name is Im Um Yo. Pastor Daniel is from Merida, Mexico. The photograph was taken at Bolo monument. Bolo monument is located in Matanzas and it represents the place where Korean-Mexico descendants immigrants arrived to Cuba.",
      "Names": "Jerónimo Lim Kim (Im Um Yo), Pastor Daniel",
      "Subject": "Object--Monument, People--Jerónimo Lim Kim (Im Um Yo), People--Pastor Daniel, Place--Cuba",
      "Date": "2005",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_051.jpg",
      "Title": "Left to right, Jerónimo Lim Kim (Im Um Yo) and Pastor Daniel at the sign of Memorial Coreano (El Bolo), 2005",
      "Notes": "Jerónimo Lim Kim's Korean name is Im Um Yo. Pastor Daniel is from Merida, Mexico.",
      "Names": "Jerónimo Lim Kim (Im Um Yo), Pastor Daniel",
      "Subject": "People--Jerónimo Lim Kim (Im Um Yo), People--Pastor Daniel, Place--Cuba",
      "Date": "2005",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_052.jpg",
      "Title": "Jerónimo Lim Kim (Im Um Yo) at Bolo monument, n.d.",
      "Notes": "Jerónimo Lim Kim's Korean name is Im Um Yo.",
      "Names": "Jerónimo Lim Kim (Im Um Yo)",
      "Subject": "Object--Monument, People--Jerónimo Lim Kim (Im Um Yo), Place--Cuba",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_053.jpg",
      "Title": "José Chang's registration certificate of Korean nationals, not before 1950. ",
      "Notes": "José Chang is Cristina Chang’s father. 장흥선 is José Chang's Korean name. The certificate was issued in March 6, 1950 (단기 4283년 3월 6일).",
      "Names": "José Chang (장흥선)",
      "Subject": "Object--Document, People--José Chang (장흥선)",
      "Date": "not before 1950 ",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_054.jpg",
      "Title": "Left to right, José Jan and María Vázquez, 1945",
      "Notes": "María Vázquez was born in México. The photograph was taken in Cuba, province Matanzas, Cárdenas city. ",
      "Names": "José Jan, María Vázquez",
      "Subject": "People--José Jan, People--María Vázquez",
      "Date": "March 29th, 1945 ",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_055.jpg",
      "Title": "Juan Kim Jan, n.d.",
      "Notes": "Juan Kim Jan was born in Cuba. ",
      "Names": "Juan Kim Jan",
      "Subject": "People--Juan Kim Jan",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_056.jpg",
      "Title": "A Korean traditional dancer who taught the dance in Cuba, n.d.",
      "Notes": "N/A",
      "Names": "N/A",
      "Subject": "People--Others",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_057.jpg",
      "Title": "Left to right, Santiago Kim and Micaela Jan, n.d.",
      "Notes": "Micaela Jan and Santiago Kim were born in Mexico and came to live in Cuba. ",
      "Names": "Micaela Jan, Santiago Kim ",
      "Subject": "People--Micaela Jan, People--Santiago Kim ",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_058.jpg",
      "Title": "Left to right, Micaela Jan and Santiago Kim, 1947",
      "Notes": "Micaela Jan and Santiago Kim were born in Mexico and came to live in Cuba. The photograph was taken in Cuba, province Matanzas, Cárdenas city. 8/2/1947 ",
      "Names": "Micaela Jan, Santiago Kim ",
      "Subject": "Event--Wedding, People--Micaela Jan, People--Santiago Kim",
      "Date": "February 8th, 1947",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_059.jpg",
      "Title": "Micaela Jan, 1929",
      "Notes": "Micaela Jan was born in Mexico and came to live in Cuba. Micaela Jan is Santiago Kim's wife. The photograph was taken when Micaela Jan was 13 years old, in 1929.",
      "Names": "Micaela Jan",
      "Subject": "People--Micaela Jan",
      "Date": "1929",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_060_1.jpg",
      "Title": "Nema Lee, not after 1944",
      "Notes": "Nema Lee: At the top in black ink, Mexico. \"To my relative, Antonio Lee Gonzales. I dedicate this as the last memory/souvenir of our friendship. Years and years will pass and when we see our temple crowned... [illegible] from here to there you remembered our friendship so dear. Our friendship is [illegible] throughout an equivocation/mistake and now is the occasion I want and [illegible] that these simple letters that I write here will be my most faithful [illegible] and I know they will carry to you all my sincerity, [illegible stuff] happiness, although our friendship can never return (?) to be as close, thus with sadness [illegible illegible...] to tell you everything is for your sake, Sincerely Nema Lee, 1944.\"",
      "Names": "Nema Lee, Antonio Lee Gonzales",
      "Subject": "People--Nema Lee",
      "Date": "not after 1944",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_060_2"
    },
    {
      "File_Name": "EAL_061.jpg",
      "Title": "The first Korean teacher (first from right) and his students, 2011",
      "Notes": "N/A",
      "Names": "N/A",
      "Subject": "People--Others",
      "Date": "November, 2011",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_062.jpg",
      "Title": "An unidentified woman, n.d.",
      "Notes": "N/A",
      "Names": "N/A",
      "Subject": "People--Others",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_063_1.jpg",
      "Title": "A large group of people standing around a party table, n.d.",
      "Notes": "N/A",
      "Names": "N/A",
      "Subject": "Event--Others, People--Others",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_063_2"
    },
    {
      "File_Name": "EAL_064.jpg",
      "Title": "Left to right, Santiago Kim and Micaela, 1947",
      "Notes": "N/A",
      "Names": "Micaela Jan, Santiago Kim ",
      "Subject": "Event--Wedding, People--Micaela Jan, People--Santiago Kim ",
      "Date": "February 8th, 1947",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_065.jpg",
      "Title": "Santiago Kim, 1930",
      "Notes": "N/A",
      "Names": "Santiago Kim ",
      "Subject": "People--Santiago Kim ",
      "Date": "August 23th, 1930",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_066_1.jpg",
      "Title": "Unidentified two women, 1945 or 1949",
      "Notes": "Note on the back of the photograph in Spanish: \"To Simona and Domingo, a memory/souvenir of your friend, who appreciates, Nemita and [illegible]  7-8 May 1945 or 1949\"",
      "Names": "N/A",
      "Subject": "People--Others",
      "Date": "not after May 7th-8th, 1945 or 1949",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_066_2"
    },
    {
      "File_Name": "EAL_067_1.jpg",
      "Title": "A large group of people at the wedding of unidentified couple (seated at the table), not after 1949",
      "Notes": "Note on the back of the photograph in Spanish: \"For my cousin Simona Lee, as a remembrance of the wedding of your cousin, Salvador Jo Cha (?) 7-7-1949\"",
      "Names": "N/A",
      "Subject": "Event--Wedding, People--Others",
      "Date": "not after July 7th, 1949",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_067_2"
    },
    {
      "File_Name": "EAL_068.jpg",
      "Title": "Wedding of an unidentified couple, 1954",
      "Notes": "N/A",
      "Names": "N/A",
      "Subject": "Event--Wedding, People--Others",
      "Date": "December 30th, 1954",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_069.jpg",
      "Title": "Wedding of an unidentified couple, 1951",
      "Notes": "N/A",
      "Names": "N/A",
      "Subject": "Event--Wedding, People--Others",
      "Date": "February 3rd, 1951",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_070.jpg",
      "Title": "Wedding of an unidentified couple, n.d.",
      "Notes": "N/A",
      "Names": "N/A",
      "Subject": "Event--Wedding, People--Others",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_071.jpg",
      "Title": "Wedding of Cristina Chang (left) and Im Um Yo (Jerónimo Lim Kim, right), 1952 ",
      "Notes": "N/A",
      "Names": "Cristina Chang, Jerónimo Lim Kim (Im Um Yo)",
      "Subject": "Event--Wedding, People--Cristina Chang, People--Jerónimo Lim Kim (Im Um Yo)",
      "Date": "1952",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_072.jpg",
      "Title": "Wedding of Rosendo Kim Jan (center, behind unidentified children) attended by unidentified people, n.d.",
      "Notes": "N/A",
      "Names": "Rosendo Kim Jan",
      "Subject": "Event--Wedding, People-Rosendo Kim Jan, People--Others",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_073.jpg",
      "Title": "Wedding of an unidentified couple, n.d.",
      "Notes": "N/A",
      "Names": "N/A",
      "Subject": "Event--Wedding, People--Others",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_074.jpg",
      "Title": "Wedding of an unidentified couple, n.d.",
      "Notes": "N/A",
      "Names": "N/A",
      "Subject": "Event--Wedding, People--Others",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_075.jpg",
      "Title": "Left to right, Felipe Fong, Antonio Fong Ahn, Olga Fong Ahn, and María Dolores Ahn in front of Capitolio, Old Havana, Cuba, n.d.",
      "Notes": "Felipe Fong is Antonio Fong Ahn´s godfather. Olga Fong Ahn is Antonio Fong Ahn´s sister. María Dolores Ahn is Antonio Fong Ahn´s mother. The photograph was taken in front of Capitolio, Old Havana, Cuba.",
      "Names": "Antonio Fong Ahn, Felipe Fong, María Dolores Ahn, Olga Fong Ahn",
      "Subject": "People--Antonio Fong Ahn, People--Felipe Fong, People--María Dolores Ahn, People--Olga Fong Ahn, Place--Cuba",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_076.jpg",
      "Title": "Left to right, Jim Fong, María Kim (Weon Jeon Kim), and another cousin of Antonio Fong Ahn, n.d.",
      "Notes": "Jim Fong and the other girl are two cousins of Antonio Fong Ahn. María Kim (Weon Jeon Kim) is Antonio Fong Ahn’s grandmother. María Kim's Korean name is Weon Jeon Kim. The photograph was taken in New York City, USA.",
      "Names": "Jim Fong, María Kim (Weon Jeon Kim)",
      "Subject": "People--Jim Fong, People--María Kim (Weon Jeon Kim), People--Others, Place--USA",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_077.jpg",
      "Title": "María Dolores Ahn, n.d.",
      "Notes": "María Dolores Ahn is Antonio Fong Ahn´s mother.",
      "Names": "María Dolores Ahn",
      "Subject": "People--María Dolores Ahn",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_078.jpg",
      "Title": "Julia Ahn with Howard Kim and Harry Kim, n.d.",
      "Notes": "Julia Ahn is Antionio Fong Ahn´s aunt. The kids are Howard Kim and Harry Kim. This photograph was taken in New York City around 50 years.",
      "Names": "Harry Kim, Howard Kim, Julia Ahn",
      "Subject": "People--Harry Kim, People--Howard Kim, People--Julia Ahn, Place--USA",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_079.jpg",
      "Title": "Left to right, Olga Fong Ahn, María Dolores Ahn, Antonio Fong Ahn, and Antonio Fong, n.d.",
      "Notes": "Olga Fong Ahn is Antonio Fong Ahn´s sister. María Dolores Ahn is Antonio Fong Ahn´s mother. Antonio Fong is Antonio Fong Ahn´s father.",
      "Names": "Antonio Fong, Antonio Fong Ahn, María Dolores Ahn, Olga Fong Ahn",
      "Subject": "People--Antonio Fong, People--Antonio Fong Ahn, People--María Dolores Ahn, People--Olga Fong Ahn",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_080.jpg",
      "Title": "Upper left to right, Antonio Fong Ahn, Juana Ahn, María Kim (Weon Jeon Kim) (in a black dress), Olga Fong Ahn (in a white dress), Álvaro Kim, María Dolores Ahn; a standing boy, Alfonso Kim, n.d.",
      "Notes": "Juana Ahn is Antonio Fong Ahn´s aunt. María Kim (Weon Jeon Kim) is Antonio Fong Ahn’s grandmother. María Kim's Korean name is Weon Jeon Kim. Olga Fong Ahn is Antonio Fong Ahn´s sister. Álvaro Kim is Antonio Fong Ahn´s cousin. María Dolores Ahn is Antonio Fong Ahn´s mother. Alfonso Kim is Antonio Fong Ahn´s cousin.",
      "Names": "Alfonso Kim, Álvaro Kim, Antonio Fong Ahn, Juana Ahn, María Dolores Ahn, María Kim (Weon Jeon Kim), Olga Fong Ahn",
      "Subject": "People--Alfonso Kim, People--Álvaro Kim, People--Antonio Fong Ahn, People--Juana Ahn, People--María Dolores Ahn, People--María Kim (Weon Jeon Kim), People--Olga Fong Ahn",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_081.jpg",
      "Title": "Left to right, Juana Ahn, Antonio Fong Ahn (a boy), Julia Ahn, and Rosa Ahn, n.d.",
      "Notes": "Juana Ahn and Julia Ahn are Antonio Fong Ahn´s aunts. Rosa Ahn is Antonio Fong Ahn´s cousin.",
      "Names": "Antonio Fong Ahn, Juana Ahn, Julia Ahn, Rosa Ahn",
      "Subject": "People--Antonio Fong Ahn, People--Juana Ahn, People--Julia Ahn, People--Rosa Ahn",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_082.jpg",
      "Title": "Left to right, an unidentified person, Juana Kim, Nena Kim, and María Kim (Weon Jeon Kim), n.d.",
      "Notes": "Juana Kim is Antonio Fong Ahn’s aunt. Nena Kim is Antonio Fong Ahn´s friend, and Nena is her nickname. María Kim (Weon Jeon Kim) is Antonio Fong Ahn’s grandmother. María Kim's Korean name is Weon Jeon Kim. ",
      "Names": "Juana Kim, María Kim (Weon Jeon Kim), Nena Kim",
      "Subject": "People--Juana Kim, People--María Kim (Weon Jeon Kim), People--Nena Kim, People--Others",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_083.jpg",
      "Title": "Left to right, Harry Kim, Julia Ahn, Lorenzo Ahn, and Rosa Ahn, 1947",
      "Notes": "Harry Kim's father was Korean, and his mother was Irish. Julia Ahn is Antonio Fong Ahn´s aunt. She is the wife of Harry Kim. Lorenzo Ahn is Antonio Fong Ahn´s uncle who lives in Miami, USA. Rosa Ahn is Antonio Fong Ahn´s cousin. The photograph was taken in New York City in June, 8th, 1947.",
      "Names": "Harry Kim, Julia Ahn, Lorenzo Ahn, Rosa Ahn",
      "Subject": "People--Harry Kim, People--Julia Ahn, People--Lorenzo Ahn, People--Rosa Ahn, Place--USA",
      "Date": "June, 8th, 1947",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_084.jpg",
      "Title": "Left to right, Victor Luis Lara Kim, and Cira Lara Kim, n.d.",
      "Notes": "The photograph was taken when Victor Luis Lara Kim was 5 years old, who lives in Cárdenas, Matanzas, Cuba, and Cira Lara Kim was 3 years old, who now lives in Spain. Victor Luis Lara Kim is Antonio Kim Jam´s nephew, and Cira Lara Kim is Antonio Kim Jam´s niece. ",
      "Names": "Cira Lara Kim, Victor Luis Lara Kim",
      "Subject": "People--Cira Lara Kim, People--Victor Luis Lara Kim",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_085.jpg",
      "Title": "Margarita Hi, n.d.",
      "Notes": "Margarita Hi is Antonio Kim Jam´s maternal grandmother. She was born in Korea and passed away in 1972.",
      "Names": "Margarita Hi",
      "Subject": "People--Margarita Hi",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_086.jpg",
      "Title": "Upper left to right, Victor Kim Kim, Josefina Jam Hi, Antonio Kim Jam, Cira Tudela Muñoz, and Victor Luis Lara Kim; Lower left to right, Miguel Guitiérrez Kim, and Cira Lara Kim, n.d.",
      "Notes": "Antonio Kim Jam is the president of Korean descendants in Havana City. Victor Kim Kim is Antonio Kim Jam's father. Josefina Jam Hi is Antonio Kim Jam's mother. Cira Tudela Muñoz is Antonio Kim Jam's wife. Victor Luis Lara Kim is Antonio Kim Jam's nephew. Miguel Guitiérrez Kim is Antonio Kim Jam's nephew. Cira Lara Kim is Antonio Kim Jam's niece.",
      "Names": "Antonio Kim Jam, Cira Lara Kim, Cira Tudela Muñoz, Josefina Jam Hi, Miguel Guitiérrez Kim, Victor Kim Kim, Victor Luis Lara Kim",
      "Subject": "People--Antonio Kim Jam, People--Cira Lara Kim, People--Cira Tudela Muñoz, People--Josefina Jam Hi, People--Miguel Guitiérrez Kim, People--Victor Kim Kim, People--Victor Luis Lara Kim",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_087.jpg",
      "Title": "Lidia Kim Jam, holding her baby Victor Luis Lara Kim, 1967",
      "Notes": "Lidia Kim Jam is Antonio Kim Jam´s sister, and she lives in Cárdenas. She is holding her baby, Victor Luis Lara Kim, who is Antonio Kim Jam´s nephew. The photograph was taken in 1967. ",
      "Names": "Lidia Kim Jam, Victor Luis Lara Kim",
      "Subject": "People--Lidia Kim Jam, People--Victor Luis Lara Kim",
      "Date": "1967",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_088.jpg",
      "Title": "Left to right, Victor Luis Lara Kim, Cira Lara Kim, Félix Kim Jam, n.d.",
      "Notes": "The man is Félix Kim Jam, who is Antonio Kim Jam´s older brother. He was born in 1948 and passed away in 2014. The children are Victor Luis Lara Kim, who is Antonio Kim Jam´s nephew, and Cira Lara Kim, who is Antonio Kim Jam´s niece.",
      "Names": "Cira Lara Kim, Félix Kim Jam, Victor Luis Lara Kim",
      "Subject": "People--Cira Lara Kim, People--Félix Kim Jam, People--Victor Luis Lara Kim",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_089.jpg",
      "Title": "Upper standing left to right, Patricia Aimee Lim Chang, Celia García Acosta, Antonio Kim Jam, Nadia Kang (the lady behind Antonio Kim Jam), Luis Raúl (in a checkered shirt) and unidentified people; the furthest right man, Antonio Fong Ahn; sitting on the chairs, left to right, Eva Ferrer Kim, Teresa Arce, and Cristina Chang, n.d.",
      "Notes": "Celia García Acosta is Nestor Kim´s wife. She is not Korean descendant. Antonio Kim Jam is the president of a Korean descendants in Havana City. Teresa Arce is Antonio Fong Ahn's wife. She is not a Korean descendant.\r\n",
      "Names": "Antonio Fong Ahn, Antonio Kim Jam, Celia García Acosta, Cristina Chang, Eva Ferrer Kim, Luis Raúl, Nadia Kang, Patricia Aimee Lim Chang, Teresa Arce",
      "Subject": "People--Antonio Fong Ahn, People--Antonio Kim Jam, People--Celia García Acosta, People--Cristina Chang, People--Eva Ferrer Kim, People--Luis Raúl, People--Nadia Kang, People--Patricia Aimee Lim Chang, People--Teresa Arce, People--Others",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_090.jpg",
      "Title": "Félix Kim Jam, n.d.",
      "Notes": "Félix Kim Jam is Antonio Kim Jam´s older brother. He was born in 1948 and passed away in 2014. ",
      "Names": "Félix Kim Jam",
      "Subject": "People--Félix Kim Jam",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_091.jpg",
      "Title": "Left to right, an unidentified woman, Victor Kim Kim, and Josefina Jam Hi, 1959",
      "Notes": "The older couple are Antonio Kim Jam´s parents, Victor Kim Kim and Josefina Jam Hi. The photograph was taken in December 15, 1959, Cárdenas, Matanzas, Cuba.",
      "Names": "Victor Kim Kim, Josefina Jam Hi",
      "Subject": "People--Victor Kim Kim, People--Josefina Jam Hi, Place--Cuba",
      "Date": "December 15th, 1959",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_092.jpg",
      "Title": "Left to right, Fidela Kim Jam, and Dionisia Pak, n.d.",
      "Notes": "Fidela Kim Jam is Antonio Kim Jam´s older sister. Dionisia Pak is a cousin of Antonio. ",
      "Names": "Dionisia Pak, Fidela Kim Jam",
      "Subject": "People--Dionisia Pak, People--Fidela Kim Jam",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_093.jpg",
      "Title": "Antonio Kim Jam, 1981",
      "Notes": "Antonio Kim Jam is the president of Korean descendants in Havana City.",
      "Names": "Antonio Kim Jam",
      "Subject": "People--Antonio Kim Jam",
      "Date": "August 28th, 1981",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_094.jpg",
      "Title": "Antonio Kim Jam, 1962",
      "Notes": "The photograph was taken in Russia, 1962, when Antonio Kim Jam was 19 years old. Antonio Kim Jam is the president of Korean descendants in Havana City.",
      "Names": "Antonio Kim Jam",
      "Subject": "People--Antonio Kim Jam",
      "Date": "1962",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_095.jpg",
      "Title": "Jerónimo Lim Kim (Im Um Yo) (upper center in a black jacket), and other family members, n.d.",
      "Notes": "This photograph is exhibited in Martha Lim Kim´s family tree section in the museum.",
      "Names": "Jerónimo Lim Kim (Im Um Yo)",
      "Subject": "People--Jerónimo Lim Kim (Im Um Yo)",
      "Date": "Unknown",
      "Photographer": "Unknown"
    },
    {
      "File_Name": "EAL_096.jpg",
      "Title": "Lorenza Kin González, n.d.",
      "Notes": "Lorenza Kin González is Gaspar´s mother.",
      "Names": "Lorenza Kin González",
      "Subject": "People--Lorenza Kin González",
      "Date": "Unknown",
      "Photographer": "Unknown"
    }
  ]
}
